Revit 2027 API
BuiltInFailures.WallFailures.ShorterThanMinWallError Property
 Wall is shorter than minimum height allowed by its type.\nIt is [Length] and must be at least [Length].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ShorterThanMinWallError { get; }
Public Shared ReadOnly Property ShorterThanMinWallError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ShorterThanMinWallError {
	FailureDefinitionId^ get ();
}
static member ShorterThanMinWallError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace